user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ cat wraparound.c
#include<limits.h>
#include<stdio.h>

int main()
{
	unsigned int x = UINT_MAX;
	++x;
	unsigned int y = x;
	
	return 0;
}
user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ gcc wraparound.c -o wraparound -ggdb
user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ ddb wraparound -q
No command 'ddb' found, but there are 21 similar ones
ddb: command not found
user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ gdb wraparound -q
Reading symbols from wraparound...done.
(gdb) b 7
Breakpoint 1 at 0x80483e8: file wraparound.c, line 7.
(gdb) r
Starting program: /home/user/Documents/ENPM-691/C Programs/wraparound 

Breakpoint 1, main () at wraparound.c:7
7		++x;
(gdb) print x
$1 = 4294967295
(gdb) print &x
$2 = (unsigned int *) 0xbffff030
(gdb) x/4bt &x
0xbffff030:	11111111	11111111	11111111	11111111
(gdb) ni
8		unsigned int y = x;
(gdb) print x
$3 = 0
(gdb) ni
0x080483ef	8		unsigned int y = x;
(gdb) print y
$4 = 3086737408
(gdb) ni
10		return 0;
(gdb) print y
$5 = 0
(gdb) qut
Undefined command: "qut".  Try "help".
(gdb) quit
A debugging session is active.

	Inferior 1 [process 15708] will be killed.

Quit anyway? (y or n) y
user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ CHANGED X to 0 and ++X to --X
CHANGED: command not found
user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ gcc wraparound.c -o wraparound -ggdb
user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ gdb wraparound -qReading symbols from wraparound...done.
(gdb) list
1	#include<limits.h>
2	#include<stdio.h>
3	
4	int main()
5	{
6		unsigned int x = 0;
7		--x;
8		unsigned int y = x;
9		
10		return 0;
(gdb) b 7
Breakpoint 1 at 0x80483e8: file wraparound.c, line 7.
(gdb) r
Starting program: /home/user/Documents/ENPM-691/C Programs/wraparound 

Breakpoint 1, main () at wraparound.c:7
7		--x;
(gdb) print x
$1 = 0
(gdb) ni
8		unsigned int y = x;
(gdb) print x
$2 = 4294967295
(gdb) quit
A debugging session is active.

	Inferior 1 [process 15733] will be killed.

Quit anyway? (y or n) y
user@user-VirtualBox:~/Documents/ENPM-691/C Programs$ 

